#ifndef ENCODER_H_
#define ENCODER_H_

#include "sys.h"

#define ENCODER_TIM_PERIOD (u16)(65535)

/******************************************************************
*函数名称:	Tim2EncoderInit
*函数功能:	初始化定时器2,用于编码器
*函数参数:	无
*返 回 值:	无
*******************************************************************/
void Tim2EncoderInit(void);

/******************************************************************
*函数名称:	Tim4EncoderInit
*函数功能:	初始化定时器4,用于编码器
*函数参数:	无
*返 回 值:	无
*******************************************************************/
void Tim4EncoderInit(void);

/******************************************************************
*函数名称:	ReadEncoderValue
*函数功能:	读取编码器的值
*函数参数:	timeValue:		定时器数(2和4)
*返 回 值:	encoderValue:	读取指定的定时器的CNT值
*******************************************************************/
u16 ReadEncoderValue(u8 timeValue);

#endif
