#ifndef ADC_H_
#define ADC_H_

#include "sys.h"

#define BATTERY_ADC_CHANNEL 4	//电池电压采集的ADC通道

/******************************************************************
*函数名称:	Adc1Init
*函数功能:	初始化ADC,用于测试电池电压
*函数参数:	无
*返 回 值:	无
*******************************************************************/
void Adc1Init(void);

/******************************************************************
*函数名称:	GetAdc1Value
*函数功能:	得到ADC1指定通道的采样值
*函数参数:	channel:	采样通道
*返 回 值:	采样值
*******************************************************************/
int GetAdc1Value(u8 channel);

/******************************************************************
*函数名称:	GetBatteryVoltage
*函数功能:	得到电池的电压值
*函数参数:	无
*返 回 值:	voltage:	电池电压(单位V)
*******************************************************************/
float GetBatteryVoltage(void);

#endif
