#ifndef WIRELESS_H_
#define WIRELESS_H_

#include "sys.h"

/********************ReadWirelessCom()函数专用********************/
#define BLANCE_COM			0	//平衡模式
#define GO_COM				1	//前进模式
#define RETREAT_COM			2	//后退模式
#define LEFT_COM			3	//左转模式
#define RIGHT_COM			4	//右转模式
/*****************************************************************/

/******************************************************************
*函数名称:	ReadWirelessCom
*函数功能:	读取无线的命令,保存在ReceiveCom变量里
*函数参数:	无
*返 回 值:	无
*******************************************************************/
void ReadWirelessCom(void);

/******************************************************************
*函数名称:	GetWirelessCom
*函数功能:	得到无线的命令,即得到ReceiveCom变量的值
*函数参数:	无
*返 回 值:	ReceiveCom: 无线的命令值(见头文件)
*******************************************************************/
u8 GetWirelessCom(void);

#endif
